ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/scnscb.xml
<module id="SCnSCB" HW_revision=""><register id="ICTR" width="32" offset="0x4" internal="0" description="Interrupt Control Type Register"><bitfield id="INTLINESNUM" description="Total number of interrupt lines in groups of 32." begin="4" end="0" width="5" rwaccess="R/W"/></register><register id="ACTLR" width="32" offset="0x8" internal="0" description="Auxiliary Control Register"><bitfield id="DISMCYCINT" description="Disables interruption of multi-cycle instructions" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="DISDEFWBUF" description="Disables write buffer us during default memorty map accesses" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="DISFOLD" description="Disables IT folding." begin="2" end="2" width="1" rwaccess="R/W"/></register></module>